docs/track_my_music.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-Mar-25 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Track My Music Listening History</title>
<meta name="author" content="Veera Sivarajan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">Github</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content" class="content">
<header>
<h1 class="title">Track My Music Listening History</h1>
<p class="subtitle" role="doc-subtitle">(Mar 25, 2023)</p>
</header><p>
I have all my music downloaded on the computer and listen to them using a lightweight music player. This setup worked fine for a while but soon I felt a need for a way to track my music listening history. I wanted a simple tool to log all the music I listen to and view it through an interface that allows me to query using different parameters. 
</p>

<p>
So I wrote a small daemon that watches for music files I open using <code>inotify</code> API and logs the song title along with current date and time to a local SQLite database. To view my listening history, I wrote a web interface that can query the database through a bunch GET routes. For example, accessing the <code>/top/5</code> route will display my top five most listened tracks in a HTML table decorated with minimal CSS.
</p>

<p>
The daemon was built using the <a href="https://docs.rs/daemonize/latest/daemonize/">daemonize</a> library as it gives nice declarative APIs to configure and spin up a daemon quickly. For the web interface, I used <a href="https://rocket.rs/">Rocket.rs</a> as using attributes to match against paths and the built-in mechanism to pass database connection between various request handlers made the application simple and easy to understand.
</p>

<p>
To conclude, despite it being a <a href="https://github.com/veera-sivarajan/music-daemon">small project</a>, I learnt a lot and had fun working on it.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Last updated on 2023-Mar-25 Sat 17:30. <br>
</div>
</footer>
</body>
</html>
